import React from 'react'

export const Question = [
    {
        text:"からくり君から見た、辛唐先輩の位置を直交座標を用いて示せ。",
        choice:["(100, 90)","(0, 4)","(0,0)","(3,4)"],
        ans:"(2,4)",
        hint:"ポスターに答えが載っているぞ!",
        comment:"good"
    },
    {
        text:"からくり君から見た、辛唐先輩の位置を極座標を用いて示せ。",
        choice:["(4,90)","(9,10)","(4,π)","(4,9)"],
        ans:"(2√3,π/3)",
        hint:"ポスターに答えが載っているぞ!",
        comment:"君は今2次元を掌握した"
    },
    {
        text:"ここはどこ？",
        choice:["長崎","鹿児島","福岡"],
        ans:"熊本",
        hint:"まじか、間違うなよ",
        comment:"good"

    },
    {
        text:"何サークル？",
        choice:["座金","書道","バスケ"],
        ans:"からくり",
        hint:"自明ですよね...",
        comment:"good"

    },
    {
        text:"夏ロボぞうさんロボットで使われていた車輪はなんでしょう",
        choice:["オムニホイール","独立ステアリング","キャスターホイール"],
        ans:"メカナムホイール",
        hint:"ざんねん もう一回ポスターを見てみよう",
        comment:"やったね 間違いの選択肢についても調べて"

    }
]