import React from 'react'

export const Question = [
    {
        text:"何サークル？",
        choice:["野球","書道","バスケ","陸上","バドミントン","水泳"],
        ans:"からくり",
        hint:"周りを見てみて",
        comment:"good"

    },
    {
        text:"夏ロボぞうさんロボットで使われていた車輪はなんでしょう",
        choice:["オムニホイール","独立ステアリング","キャスターホイール"],
        ans:"メカナムホイール",
        hint:"ざんねん もう一回ポスターを見てみよう",
        comment:"やったね 間違いの選択肢についても調べて"

    },
    {
        text:"からくり君から見た、辛唐先輩の位置を直交座標を用いて示せ。",
        choice:["(100, 90)",,"(0,0)","(3,4)"],
        ans:"(0, 4)",
        hint:"ポスターに答えが載っているぞ!",
        comment:"good"
    },
    {
        text:"からくり君から見た、辛唐先輩の位置を極座標を用いて示せ。",
        choice:["(4,π)","(9,10)","(4,9)"],
        ans:"(4,90)",
        hint:"ポスターに答えが載っているぞ!",
        comment:"君は今2次元を掌握した"
    },
    {
        text:"UFOキャッチャーのアームはどうやって動いているでしょうか？",
        choice:["DCモータ","ステッピングモータ","ブラシレスモータ"],
        ans:"サーボモータ",
        hint:"〇〇〇モータだったよね？3文字）",
        comment:"きみもこれでモータマスターだ！"
    },
    {
        text:"UFOキャッチャーに使われいるしくみは何でしょうか？",
        choice:["ヒットアンドアウェイ","バトルアンドゲット","ラックアンドミニオン"],
        ans:"ラックアンドピニオン",
        hint:"〇〇〇アンド〇〇〇〇だったよね？（3アンド4文字）",
        comment:"きみもこれでからくりマスターだ！"
    },
]